[{"content":"## The story behind the Airflow Breeze tool\nInitially, we started contributing to this fantastic open-source project [Apache Airflow] with a team of three which then grew to five. When we kicked it off a year ago, I realized pretty soon where the biggest bottlenecks and areas for improvement in terms of productivity were. Even with the help of our client, who provided us with a “homegrown” development environment it took us literally days to set it up and learn some basics.\n\nThat is how the journey to increased productivity in Apache Airflow began. The result? The Airflow Breeze open-source tool. Jarek Potiuk, an Airflow Committer, will tell you all about it.\n\nYou can learn [how and why it’s a \"Breeze\" to Develop Apache Airflow on Polidea blog](https://www.polidea.com/blog/its-a-breeze-to-develop-apache-airflow/?utm_source=ApacheAirflowBlog&utm_medium=Npaid&utm_campaign=Blog&utm_term=Article&utm_content=AAB_NOP_BLG_ART_AB_001).\n","url":"Its-a-breeze-to-develop-apache-airflow","title":"It's a \"Breeze\" to develop Apache Airflow","linkTitle":"It's a \"Breeze\" to develop Apache Airflow","author":"Jarek Potiuk","twitter":"higrys","github":"potiuk","linkedin":"jarekpotiuk","description":"A Principal Software Engineer's journey to developer productivity. Learn how Jarek and his team speeded up and simplified Airflow development for the community.","tags":["Development"],"date":"2019-11-22T00:00:00.000Z"},{"content":"","url":"_index","title":"Blog","linkTitle":"Blog","menu":{"main":{"weight":25}}},{"content":"# Apache Airflow Survey 2019\n\nApache Airflow is [growing faster than ever](https://www.astronomer.io/blog/why-airflow/).\nThus, receiving and adjusting to our users’ feedback is a must. We created\n[survey](https://forms.gle/XAzR1pQBZiftvPQM7) and we got **308** responses.\nLet’s see who Airflow users are, how they play with it, and what they miss.\n\n# Overview of the user\n\n**What best describes your current occupation?**\n\n|                         |No.|  %   |\n|-------------------------|---|------|\n|Data Engineer            |194|62.99%|\n|Developer                | 34|11.04%|\n|Architect                | 23|7.47% |\n|Data Scientist           | 19|6.17% |\n|Data Analyst             | 13|4.22% |\n|DevOps                   | 13|4.22% |\n|IT Administrator         |  2|0.65% |\n|Machine Learning Engineer|  2|0.65% |\n|Manager                  |  2|0.65% |\n|Operations               |  2|0.65% |\n|Chief Data Officer       |  1|0.32% |\n|Engineering Manager      |  1|0.32% |\n|Intern                   |  1|0.32% |\n|Product owner            |  1|0.32% |\n|Quant                    |  1|0.32% |\n\n\n**In your day to day job, what do you use Airflow for?**\n\n|                                                      |No.|  %   |\n|------------------------------------------------------|---|------|\n|Data processing (ETL)                                 |298|96.75%|\n|Artificial Intelligence and Machine Learning Pipelines| 90|29.22%|\n|Automating DevOps operations                          | 64|20.78%|\n\nAccording to the survey, most of the Airflow users are the “data” people. Moreover,\n28.57% uses Airflow to both ETL and ML pipelines meaning that those two fields\nare somehow connected. Only five respondents use Airflow for DevOps operations only,\nThat means that other 59 people who use Airflow for DevOps stuff use it also for\nETL / ML  purposes.\n\n**How many active DAGs do you have in your largest Airflow instance?**\n\n|       |No.|  %   |\n|-------|---|------|\n|0-20   |115|37.34%|\n|21-40  | 65|21.10%|\n|41-60  | 44|14.29%|\n|61-100 | 28|9.09% |\n|101-200| 28|9.09% |\n|201-300|  7|2.27% |\n|301-999|  8|2.60% |\n|1000+  | 13|4.22% |\n\n\nThe majority of users do not exceed 100 active DAGs per Airflow instance. However,\nas we can see there are users who exceed thousands of DAGs with a maximum number 5000.\n\n**What is the maximum number of tasks that you have used in one DAG?**\n\n|       |No.|  %   |\n|-------|---|------|\n|0-10   | 61|19.81%|\n|11-20  | 60|19.48%|\n|21-30  | 31|10.06%|\n|31-40  | 21|6.82% |\n|41-50  | 26|8.44% |\n|51-100 | 36|11.69%|\n|101-200| 28|9.09% |\n|201-500| 21|6.82% |\n|501+   | 24|11.54%|\n\n\nThe given maximum number of tasks in a single DAG was 10 000 (!). The number of tasks\ndepends on the purposes of a DAG, so it’s rather hard to say if users have “simple”\nor “complicated” workflows.\n\n**When onboarding new members to Airflow, what is the biggest problem?**\n\n|                                                               |No.|  %   |\n|----------------------------------------------------","url":"airflow-survey","title":"Airflow Survey 2019","linkTitle":"Airflow Survey 2019","author":"Tomek Urbaszek","twitter":"Nuclearriot","github":"nuclearpinguin","linkedin":"tomaszurbaszek","description":"Receiving and adjusting to our users’ feedback is a must. Let’s see who Airflow users are, how they play with it, and what they miss.","tags":["community","survey","users"],"date":"2019-12-11"},{"content":"The brand [new Airflow website](https://airflow.apache.org/) has arrived! Those who have been following the process know that the journey to update [the old Airflow website](https://airflow.readthedocs.io/en/1.10.6/) started at the beginning of the year.\nThanks to sponsorship from the Cloud Composer team at Google that allowed us to\ncollaborate with [Polidea](https://www.polidea.com/) and with their design studio [Utilo](https://utilodesign.com/), and deliver an awesome website.\n\nDocumentation of open source projects is key to engaging new contributors in the maintenance,\ndevelopment, and adoption of software. We want the Apache Airflow community to have\nthe best possible experience to contribute and use the project. We also took this opportunity to make the project\nmore accessible, and in doing so, increase its reach.\n\nIn the past three and a half months, we have updated everything: created a more efficient landing page,\nenhanced information architecture, and improved UX & UI. Most importantly, the website now has capabilities\nto be translated into many languages. This is our effort to foster a more inclusive community around\nApache Airflow, and we look forward to seeing contributions in Spanish, Chinese, Russian, and other languages as well!\n\nWe built our website on Docsy, a platform that is easy to use and contribute to. Follow\n[these steps](https://github.com/apache/airflow-site/blob/aip-11/README.md) to set up your environment and\nto create your first pull request. You may also use\nthe new website for your own open source project as a template.\nAll of our [code is open and hosted on Github](https://github.com/apache/airflow-site/tree/aip-11).\n\nShare your questions, comments, and suggestions with us, to help us improve the website.\nWe hope that this new design makes finding documentation about Airflow easier,\nand that its improved accessibility increases adoption and use of Apache Airflow around the world.\n\nHappy browsing!\n","url":"announcing-new-website","title":"New Airflow website","linkTitle":"New Airflow website","author":"Aizhamal Nurmamat kyzy","description":"We are thrilled about our new website!","tags":["Community"],"date":"2019-12-11"},{"content":"Is it possible to create an organization that delivers tens of projects used by millions, nearly no one is paid for doing their job, and still, it has been fruitfully carrying on for more than 20 years? Apache Software Foundation proves it is possible. For the last two decades, ASF has been crafting a model called the Apache Way—a way of organizing and leading tech open source projects. Due to this approach, which is strongly based on the “community over code” motto, we can enjoy such awesome projects like Apache Spark, Flink, Beam, or Airflow (and many more).\n\nAfter this year’s ApacheCon, Polidea’s engineers talked with Committers of Apache projects, such as—Aizhamal Nurmamat kyzy, Felix Uellendall, and Fokko Driesprong—about insights to what makes the ASF such an amazing organization.\n\nYou can read the [insights on the Polidea blog](https://www.polidea.com/blog/apachecon-europe-2019-thoughts-and-insights-by-airflow-committers/?utm_source=ApacheAirflowBlog&utm_medium=Npaid&utm_campaign=Blog&utm_term=Article&utm_content=AAB_NOP_BLG_ART_APC_001).\n","url":"apache-con-europe-2019-thoughts-and-insights-by-airflow-commiters","title":"ApacheCon Europe 2019 — Thoughts and Insights by Airflow Commiters","linkTitle":"ApacheCon Europe 2019 — Thoughts and Insights by Airflow Commiters","author":"Polidea","description":"Here come some thoughts by Airflow committers and contributors from the ApacheCon Europe 2019. Get to know the ASF community!","tags":["Community"],"date":"2019-11-22"}]